window.addEventListener('DOMContentLoaded', () => {

    let textArea = document.querySelector('#text-area');
    
    let text = 
    "ある日の暮方の事である。[r]一人の下人が、羅生門の下で雨やみを待っていた。[l][r][cm]\
    　広い門の下には、この男のほかに誰もいない。[r]ただ、所々丹塗の剥げた、大きな円柱に、蟋蟀が一匹とまっている。[r]羅生門が、朱雀大路にある以上は、この男のほかにも、雨やみをする市女笠や揉烏帽子が、もう二三人はありそうなものである。[r]それが、この男のほかには誰もいない。[l][r][cm]\
    　何故かと云うと、この二三年、京都には、地震とか辻風とか火事とか饑饉とか云う災がつづいて起った。[r]そこで洛中のさびれ方は一通りではない。[r]旧記によると、仏像や仏具を打砕いて、その丹がついたり、金銀の箔がついたりした木を、路ばたにつみ重ねて、薪の料に売っていたと云う事である。[r]洛中がその始末であるから、羅生門の修理などは、元より誰も捨てて顧る者がなかった。[r]するとその荒れ果てたのをよい事にして、狐狸が棲む。[r]盗人が棲む。[r]とうとうしまいには、引取り手のない死人を、この門へ持って来て、棄てて行くと云う習慣さえ出来た。[r]そこで、日の目が見えなくなると、誰でも気味を悪るがって、この門の近所へは足ぶみをしない事になってしまったのである。[l][r][cm]\
    　その代りまた鴉がどこからか、たくさん集って来た。[r]昼間見ると、その鴉が何羽となく輪を描いて、高い鴟尾のまわりを啼きながら、飛びまわっている。[r]ことに門の上の空が、夕焼けであかくなる時には、それが胡麻をまいたようにはっきり見えた。[r]鴉は、勿論、門の上にある死人の肉を、啄みに来るのである。[r]――もっとも今日は、刻限が遅いせいか、一羽も見えない。[r]ただ、所々、崩れかかった、そうしてその崩れ目に長い草のはえた石段の上に、鴉の糞が、点々と白くこびりついているのが見える。[r]下人は七段ある石段の一番上の段に、洗いざらした紺の襖の尻を据えて、右の頬に出来た、大きな面皰を気にしながら、ぼんやり、雨のふるのを眺めていた。[l][r][cm]\
    　作者はさっき、「下人が雨やみを待っていた」と書いた。[r]しかし、下人は雨がやんでも、格別どうしようと云う当てはない。[r]ふだんなら、勿論、主人の家へ帰る可き筈である。[r]所がその主人からは、四五日前に暇を出された。[r]前にも書いたように、当時京都の町は一通りならず衰微していた。[r]今この下人が、永年、使われていた主人から、暇を出されたのも、実はこの衰微の小さな余波にほかならない。[r]だから「下人が雨やみを待っていた」と云うよりも「雨にふりこめられた下人が、行き所がなくて、途方にくれていた」と云う方が、適当である。[r]その上、今日の空模様も少からず、この平安朝の下人の Sentimentalisme に影響した。[r]申の刻下りからふり出した雨は、いまだに上るけしきがない。[r]そこで、下人は、何をおいても差当り明日の暮しをどうにかしようとして――云わばどうにもならない事を、どうにかしようとして、とりとめもない考えをたどりながら、さっきから朱雀大路にふる雨の音を、聞くともなく聞いていたのである。[l][r][cm]\
    　雨は、羅生門をつつんで、遠くから、ざあっと云う音をあつめて来る。[r]夕闇は次第に空を低くして、見上げると、門の屋根が、斜につき出した甍の先に、重たくうす暗い雲を支えている。[l][r][cm]\
    　どうにもならない事を、どうにかするためには、手段を選んでいる遑はない。[r]選んでいれば、築土の下か、道ばたの土の上で、饑死をするばかりである。[r]そうして、この門の上へ持って来て、犬のように棄てられてしまうばかりである。[r]選ばないとすれば――下人の考えは、何度も同じ道を低徊した揚句に、やっとこの局所へ逢着した。[r]しかしこの「すれば」は、いつまでたっても、結局「すれば」であった。[r]下人は、手段を選ばないという事を肯定しながらも、この「すれば」のかたをつけるために、当然、その後に来る可き「盗人になるよりほかに仕方がない」と云う事を、積極的に肯定するだけの、勇気が出ずにいたのである。[l][r][cm]\
    　下人は、大きな嚔をして、それから、大儀そうに立上った。[r]夕冷えのする京都は、もう火桶が欲しいほどの寒さである。[r]風は門の柱と柱との間を、夕闇と共に遠慮なく、吹きぬける。[r]丹塗の柱にとまっていた蟋蟀も、もうどこかへ行ってしまった。[l][r][cm]\
    　下人は、頸をちぢめながら、山吹の汗袗に重ねた、紺の襖の肩を高くして門のまわりを見まわした。[r]雨風の患のない、人目にかかる惧のない、一晩楽にねられそうな所があれば、そこでともかくも、夜を明かそうと思ったからである。[r]すると、幸い門の上の楼へ上る、幅の広い、これも丹を塗った梯子が眼についた。[r]上なら、人がいたにしても、どうせ死人ばかりである。[r]下人はそこで、腰にさげた聖柄の太刀が鞘走らないように気をつけながら、藁草履をはいた足を、その梯子の一番下の段へふみかけた。[l][r][cm]\
    　それから、何分かの後である。[r]羅生門の楼の上へ出る、幅の広い梯子の中段に、一人の男が、猫のように身をちぢめて、息を殺しながら、上の容子を窺っていた。[r]楼の上からさす火の光が、かすかに、その男の右の頬をぬらしている。[r]短い鬚の中に、赤く膿を持った面皰のある頬である。[r]下人は、始めから、この上にいる者は、死人ばかりだと高を括っていた。[r]それが、梯子を二三段上って見ると、上では誰か火をとぼして、しかもその火をそこここと動かしているらしい。[r]これは、その濁った、黄いろい光が、隅々に蜘蛛の巣をかけた天井裏に、揺れながら映ったので、すぐにそれと知れたのである。[r]この雨の夜に、この羅生門の上で、火をともしているからは、どうせただの者ではない。[l][r][cm]\
    　下人は、守宮のように足音をぬすんで、やっと急な梯子を、一番上の段まで這うようにして上りつめた。[r]そうして体を出来るだけ、平にしながら、頸を出来るだけ、前へ出して、恐る恐る、楼の内を覗いて見た。[l][r][cm]\
    　見ると、楼の内には、噂に聞いた通り、幾つかの死骸が、無造作に棄ててあるが、火の光の及ぶ範囲が、思ったより狭いので、数は幾つともわからない。[r]ただ、おぼろげながら、知れるのは、その中に裸の死骸と、着物を着た死骸とがあるという事である。[r]勿論、中には女も男もまじっているらしい。[r]そうして、その死骸は皆、それが、かつて、生きていた人間だと云う事実さえ疑われるほど、土を捏ねて造った人形のように、口を開いたり手を延ばしたりして、ごろごろ床の上にころがっていた。[r]しかも、肩とか胸とかの高くなっている部分に、ぼんやりした火の光をうけて、低くなっている部分の影を一層暗くしながら、永久に唖の如く黙っていた。[l][r][cm]\
    　下人は、それらの死骸の腐爛した臭気に思わず、鼻を掩った。[r]しかし、その手は、次の瞬間には、もう鼻を掩う事を忘れていた。[r]ある強い感情が、ほとんどことごとくこの男の嗅覚を奪ってしまったからだ。[l][r][cm]\
    　下人の眼は、その時、はじめてその死骸の中に蹲っている人間を見た。[r]檜皮色の着物を着た、背の低い、痩せた、白髪頭の、猿のような老婆である。[r]その老婆は、右の手に火をともした松の木片を持って、その死骸の一つの顔を覗きこむように眺めていた。[r]髪の毛の長い所を見ると、多分女の死骸であろう。[l][r][cm]\
    　下人は、六分の恐怖と四分の好奇心とに動かされて、暫時は呼吸をするのさえ忘れていた。[r]旧記の記者の語を借りれば、「頭身の毛も太る」ように感じたのである。[r]すると老婆は、松の木片を、床板の間に挿して、それから、今まで眺めていた死骸の首に両手をかけると、丁度、猿の親が猿の子の虱をとるように、その長い髪の毛を一本ずつ抜きはじめた。[r]髪は手に従って抜けるらしい。[l][r][cm]\
    　その髪の毛が、一本ずつ抜けるのに従って、下人の心からは、恐怖が少しずつ消えて行った。[r]そうして、それと同時に、この老婆に対するはげしい憎悪が、少しずつ動いて来た。[r]――いや、この老婆に対すると云っては、語弊があるかも知れない。[r]むしろ、あらゆる悪に対する反感が、一分毎に強さを増して来たのである。[r]この時、誰かがこの下人に、さっき門の下でこの男が考えていた、饑死をするか盗人になるかと云う問題を、改めて持出したら、恐らく下人は、何の未練もなく、饑死を選んだ事であろう。[r]それほど、この男の悪を憎む心は、老婆の床に挿した松の木片のように、勢いよく燃え上り出していたのである。[l][r][cm]\
    　下人には、勿論、何故老婆が死人の髪の毛を抜くかわからなかった。[r]従って、合理的には、それを善悪のいずれに片づけてよいか知らなかった。[r]しかし下人にとっては、この雨の夜に、この羅生門の上で、死人の髪の毛を抜くと云う事が、それだけで既に許すべからざる悪であった。[r]勿論、下人は、さっきまで自分が、盗人になる気でいた事なぞは、とうに忘れていたのである。[l][r][cm]\
    　そこで、下人は、両足に力を入れて、いきなり、梯子から上へ飛び上った。[r]そうして聖柄の太刀に手をかけながら、大股に老婆の前へ歩みよった。[r]老婆が驚いたのは云うまでもない。[l][r][cm]\
    　老婆は、一目下人を見ると、まるで弩にでも弾かれたように、飛び上った。[l][r][cm]\
    「おのれ、どこへ行く。[r]」[l][r][cm]\
    　下人は、老婆が死骸につまずきながら、慌てふためいて逃げようとする行手を塞いで、こう罵った。[r]老婆は、それでも下人をつきのけて行こうとする。[r]下人はまた、それを行かすまいとして、押しもどす。[r]二人は死骸の中で、しばらく、無言のまま、つかみ合った。[r]しかし勝敗は、はじめからわかっている。[r]下人はとうとう、老婆の腕をつかんで、無理にそこへ※(「てへん＋丑」、第4水準2-12-93)じ倒した。[r]丁度、鶏の脚のような、骨と皮ばかりの腕である。[l][r][cm]\
    「何をしていた。[r]云え。[r]云わぬと、これだぞよ。[r]」[l][r][cm]\
    　下人は、老婆をつき放すと、いきなり、太刀の鞘を払って、白い鋼の色をその眼の前へつきつけた。[r]けれども、老婆は黙っている。[r]両手をわなわなふるわせて、肩で息を切りながら、眼を、眼球が※(「目＋匡」、第3水準1-88-81)の外へ出そうになるほど、見開いて、唖のように執拗く黙っている。[r]これを見ると、下人は始めて明白にこの老婆の生死が、全然、自分の意志に支配されていると云う事を意識した。[r]そうしてこの意識は、今までけわしく燃えていた憎悪の心を、いつの間にか冷ましてしまった。[r]後に残ったのは、ただ、ある仕事をして、それが円満に成就した時の、安らかな得意と満足とがあるばかりである。[r]そこで、下人は、老婆を見下しながら、少し声を柔らげてこう云った。[l][r][cm]\
    「己は検非違使の庁の役人などではない。[r]今し方この門の下を通りかかった旅の者だ。[r]だからお前に縄をかけて、どうしようと云うような事はない。[r]ただ、今時分この門の上で、何をして居たのだか、それを己に話しさえすればいいのだ。[r]」[l][r][cm]\
    　すると、老婆は、見開いていた眼を、一層大きくして、じっとその下人の顔を見守った。[r]※(「目＋匡」、第3水準1-88-81)の赤くなった、肉食鳥のような、鋭い眼で見たのである。[r]それから、皺で、ほとんど、鼻と一つになった唇を、何か物でも噛んでいるように動かした。[r]細い喉で、尖った喉仏の動いているのが見える。[r]その時、その喉から、鴉の啼くような声が、喘ぎ喘ぎ、下人の耳へ伝わって来た。[l][r][cm]\
    「この髪を抜いてな、この髪を抜いてな、鬘にしようと思うたのじゃ。[r]」[l][r][cm]\
    　下人は、老婆の答が存外、平凡なのに失望した。[r]そうして失望すると同時に、また前の憎悪が、冷やかな侮蔑と一しょに、心の中へはいって来た。[r]すると、その気色が、先方へも通じたのであろう。[r]老婆は、片手に、まだ死骸の頭から奪った長い抜け毛を持ったなり、蟇のつぶやくような声で、口ごもりながら、こんな事を云った。[l][r][cm]\
    「成程な、死人の髪の毛を抜くと云う事は、何ぼう悪い事かも知れぬ。[r]じゃが、ここにいる死人どもは、皆、そのくらいな事を、されてもいい人間ばかりだぞよ。[r]現在、わしが今、髪を抜いた女などはな、蛇を四寸ばかりずつに切って干したのを、干魚だと云うて、太刀帯の陣へ売りに往んだわ。[r]疫病にかかって死ななんだら、今でも売りに往んでいた事であろ。[r]それもよ、この女の売る干魚は、味がよいと云うて、太刀帯どもが、欠かさず菜料に買っていたそうな。[r]わしは、この女のした事が悪いとは思うていぬ。[r]せねば、饑死をするのじゃて、仕方がなくした事であろ。[r]されば、今また、わしのしていた事も悪い事とは思わぬぞよ。[r]これとてもやはりせねば、饑死をするじゃて、仕方がなくする事じゃわいの。[r]じゃて、その仕方がない事を、よく知っていたこの女は、大方わしのする事も大目に見てくれるであろ。[r]」[l][r][cm]\
    　老婆は、大体こんな意味の事を云った。[l][r][cm]\
    　下人は、太刀を鞘におさめて、その太刀の柄を左の手でおさえながら、冷然として、この話を聞いていた。[r]勿論、右の手では、赤く頬に膿を持った大きな面皰を気にしながら、聞いているのである。[r]しかし、これを聞いている中に、下人の心には、ある勇気が生まれて来た。[r]それは、さっき門の下で、この男には欠けていた勇気である。[r]そうして、またさっきこの門の上へ上って、この老婆を捕えた時の勇気とは、全然、反対な方向に動こうとする勇気である。[r]下人は、饑死をするか盗人になるかに、迷わなかったばかりではない。[r]その時のこの男の心もちから云えば、饑死などと云う事は、ほとんど、考える事さえ出来ないほど、意識の外に追い出されていた。[l][r][cm]\
    「きっと、そうか。[r]」[l][r][cm]\
    　老婆の話が完ると、下人は嘲るような声で念を押した。[r]そうして、一足前へ出ると、不意に右の手を面皰から離して、老婆の襟上をつかみながら、噛みつくようにこう云った。[l][r][cm]\
    「では、己が引剥をしようと恨むまいな。[r]己もそうしなければ、饑死をする体なのだ。[r]」[l][r][cm]\
    　下人は、すばやく、老婆の着物を剥ぎとった。[r]それから、足にしがみつこうとする老婆を、手荒く死骸の上へ蹴倒した。[r]梯子の口までは、僅に五歩を数えるばかりである。[r]下人は、剥ぎとった檜皮色の着物をわきにかかえて、またたく間に急な梯子を夜の底へかけ下りた。[l][r][cm]\
    　しばらく、死んだように倒れていた老婆が、死骸の中から、その裸の体を起したのは、それから間もなくの事である。[r]老婆はつぶやくような、うめくような声を立てながら、まだ燃えている火の光をたよりに、梯子の口まで、這って行った。[r]そうして、そこから、短い白髪を倒にして、門の下を覗きこんだ。[r]外には、ただ、黒洞々たる夜があるばかりである。[l][r][cm]\
    　下人の行方は、誰も知らない。[r]";

    let waitClick = false;
    let tag = "";

    const Update = () => {
        if(text.length === 0) return;
        if(waitClick)
        {
            setTimeout(Update, 16);
            return;
        } 
        else {
            textArea.innerHTML = textArea.innerHTML.trimEnd("▼");
        }

        // 先頭の文字列を取得
        let letter = text[0]; 
        text = text.substring(1, text.length);
        
        // タグの読み込み
        if(letter === "[")
        {
            // タグの文字列を取得
            tag = text.substring(0, text.indexOf("]"));
            text = text.substring(text.indexOf("]")+1, text.length);
        }

        if(tag === "l")
        {
            // クリック待ち
            waitClick = true;
            let waitClickElem = document.createElement("span");
            waitClickElem.setAttribute("id", "wait-click");
            waitClickElem.innerHTML = "▼";
            textArea.appendChild(waitClickElem);
            // タグクリア
            tag = "";
        }
        else if(tag === "r")
        {
            // 改行
            textArea.innerHTML += "<br/>";
            // タグクリア
            tag = "";
        }
        else if(tag === "cm")
        {
            // テキストエリアのクリア
            textArea.innerHTML = "";
            tag = "";
        }
        else if(tag === "")
        {
            textArea.innerHTML += letter;
        }


        setTimeout(Update, 16);
    }

    document.body.addEventListener('click', function(){
        let waitClickElem = document.querySelector('#wait-click');
        waitClickElem.remove();
        waitClick = false;
    });

    Update();
});